app/controllers/api/listings_controller.rb

  def index
    @listings = bounds ? Listing.in_bounds(bounds) : Listing.all
---
SELECT "listings".* FROM "listings" WHERE (latitude < NULL) AND (latitude > NULL) AND (longitude > NULL) AND (longitude < NULL)

  def create
    @listing = Listing.new(listing_params)
    if @listing.save
---
INSERT INTO "listings" ("name", "description", "location", "longitude", "latitude", "price", "guests", "benches", "power_rack", "deadlift_platform", "created_at", "updated_at", "host_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    @listing = Listing.find(params[:id])

    if @listing.update_attributes(listing_params)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "listings" SET "longitude" = $1, "latitude" = $2, "price" = $3, "updated_at" = $4 WHERE "listings"."id" = $5  [["longitude", -118.0082287], ["latitude", 33.799006], ["price", 25.0], ["updated_at", "2019-10-16 00:01:34.041449"], ["id", 2]]

  def destroy
    @listing = Listing.find(params[:id])
    @listing.destroy
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 3]]