app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hunter2@gmail.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    email = User.find_by(email: email)