app/models/user.rb

  def self.find_by_credentials(email, password)
    email = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hunter@gmail.com"], ["LIMIT", 1]]